app/Controllers/AuthController.php

SELECT *
FROM `admin_user`
WHERE `username` = 'taha@gmail.com'
 LIMIT 1
SELECT *
FROM `admin_user`
WHERE `email` = 'taha@gmail.com'
 LIMIT 1
---
    public function register()
    {
        if ($_SERVER['REQUEST_METHOD'] == 'POST') {
            // $_POST süper globalini kullanarak verileri almak
            $username = isset($_POST['username']) ? trim($_POST['username']) : null;  // username kontrolü
            $email = isset($_POST['email']) ? trim($_POST['email']) : null;            // email kontrolü
            $password = isset($_POST['password']) ? $_POST['password'] : null;    // password kontrolü

            // Username, email, and password kontrolü
            if (empty($username) || empty($email) || empty($password)) {
                session()->setFlashdata('error', 'Please fill in all fields.');
                return redirect()->back()->withInput();
            }

            // Kullanıcı adının zaten var olup olmadığını kontrol ediyoruz
            $existingUser = $this->adminUserModel->where('username', $username)->first();
            if ($existingUser) {
                session()->setFlashdata('error', 'This username is already taken.');
                return redirect()->back()->withInput();
            }

            // E-posta adresinin zaten var olup olmadığını kontrol ediyoruz
            $existingEmail = $this->adminUserModel->where('email', $email)->first();

INSERT INTO `admin_user` (`username`, `email`, `password`, `created_at`, `updated_at`) VALUES ('taha@gmail.com', 'taha@gmail.com', '$2y$10$85tctoehgL8KFY0dDbPabu.tCghkxpfK8LxuifSw8Ct9e4SRWKNuO', '2025-03-28 17:35:32', '2025-03-28 17:35:32')
---
            ];

            // Kullanıcıyı veritabanına kaydet
            $result = $this->adminUserModel->save($data);