app/Controllers/CartController.php

SELECT *
FROM `product`
WHERE `product`.`id` = '5'
---
    public function addProduct()
    {
        $cartModel = new CartModel();
        $productModel = new ProductModel();

        // Formdan gelen verileri alıyoruz
        $productId = $this->request->getPost('product_id');
        $product = $productModel->find($productId);