app/Controllers/SepetController.php

SELECT *
FROM `product`
---
    public function index()
    {
        $model = new ProductModel();  // Model nesnesi oluştur
        $products = $model->findAll();  // Veritabanından tüm ürünleri al