app/Controllers/UserController.php

SELECT *
FROM `user`
WHERE `email` = 'taha@gmail.com'
 LIMIT 1
INSERT INTO `user` (`username`, `email`, `password`, `created_at`, `updated_at`) VALUES ('tahaoluc', 'taha@gmail.com', '$2y$10$eFeVnPz.KHsRns2ZPt./KeeCNCvrLlBw14ptkP0h6qhSQKUSAeFse', '2025-01-29 18:31:04', '2025-01-29 18:31:04')
---
    public function register()
    {
        // $_POST süper globali ile form verilerini al
        $username = $_POST['username'] ?? '';
        $email = $_POST['email'] ?? '';
        $password = $_POST['password'] ?? '';

        // UserModel'i yükle
        $userModel = new UserModel();

        // Aynı e-posta adresi var mı kontrol et
        $existingUser = $userModel->where('email', $email)->first();

        if ($existingUser) {
            // E-posta adresi zaten varsa hata mesajı göster
            return redirect()->back()->withInput()->with('email_error', 'Bu e-posta adresi kullanımda.');
        }

        // Şifreyi hash'le
        $hashedPassword = password_hash($password, PASSWORD_DEFAULT);

        // Kullanıcı verisi
        $userData = [
            'username' => $username,
            'email' => $email,
            'password' => $hashedPassword,
        ];

        // Kullanıcıyı veritabanına kaydet
        if ($userModel->insert($userData)) {

SELECT *
FROM `user`
WHERE `email` = 'taha@gmail.com'
 LIMIT 1
---
    public function login()
    {
        // $_POST süper globali ile formdan gelen verileri al
        $email = $_POST['email'] ?? '';
        $password = $_POST['password'] ?? '';

        // UserModel'i yükle
        $userModel = new UserModel();

        // E-posta ile kullanıcıyı bul
        $user = $userModel->where('email', $email)->first();