app/Models/AdminUserModel.php

SELECT *
FROM `admin_user`
WHERE `username` = 'abdullah37567'
OR `email` = 'abdullah37567'
 LIMIT 1
---
    public function getUserByUsernameOrEmail($usernameOrEmail)
    {
        return $this->where('username', $usernameOrEmail)
                    ->orWhere('email', $usernameOrEmail)
                    ->first();