app/Models/CartModel.php

SELECT `cart`.`id`, `cart`.`quantity`, `product`.`id` as `product_id`, `product`.`product_name`, `product`.`product_price`, `product`.`product_image`
FROM `cart`
JOIN `product` ON `cart`.`product_id` = `product`.`id`
WHERE `cart`.`user_id` = '43'
---
    public function getProductsWithCart($userId)
    {
        return $this->select('cart.id, cart.quantity, product.id as product_id, product.product_name, product.product_price, product.product_image')
                    ->join('product', 'cart.product_id = product.id')
                    ->where('cart.user_id', $userId) // Kullanıcıya özel filtreleme
                    ->findAll();

SELECT *
FROM `cart`
WHERE `product_id` = '5'
AND `user_id` = '43'
 LIMIT 1
INSERT INTO `cart` (`product_id`, `name`, `quantity`, `user_id`, `price`) VALUES ('5', 'Nike Mercurial 9', '3', '43', 4500)
---
    public function addProductToCart($data, $userId)
    {
        // Kullanıcı ID'si ile veriyi ekliyoruz
        $data['user_id'] = $userId;

        // Öncelikle ürün var mı kontrol ediyoruz
        $existingProduct = $this->where('product_id', $data['product_id'])
                                ->where('user_id', $userId)
                                ->first();

        // Ürün sepette zaten varsa, miktarını ve fiyatını arttırıyoruz
        if ($existingProduct) {
            $newQuantity = $existingProduct['quantity'] + $data['quantity'];
            $newTotalPrice = $data['product_price'] * $newQuantity; // Yeni toplam fiyat

            // Ürün miktarını ve fiyatını güncelliyoruz
            return $this->update($existingProduct['id'], [
                'quantity' => $newQuantity,
                'price' => $newTotalPrice
            ]);
        }

        // Ürün sepette yoksa, yeni ürün ekliyoruz
        $totalPrice = $data['product_price'] * $data['quantity']; // Yeni ürün için fiyat hesaplama
        $data['price'] = $totalPrice; // Fiyatı ekliyoruz

        return $this->insert($data);

SELECT SUM(cart.quantity * product.product_price) as total
FROM `cart`
JOIN `product` ON `cart`.`product_id` = `product`.`id`
WHERE `cart`.`user_id` = '43'
 LIMIT 1
---
    public function getCartTotal($userId)
    {
        return $this->select('SUM(cart.quantity * product.product_price) as total')
                    ->join('product', 'cart.product_id = product.id')
                    ->where('cart.user_id', $userId) // Kullanıcıya özel filtreleme
                    ->first();

DELETE FROM `cart`
WHERE `user_id` = '43'
---
    public function clearCart($userId)
    {
        return $this->where('user_id', $userId)->delete();