app/Models/MysqlAdminModel.php

    public function getContactMessages()
    {
        return $this->db->table('contact_messages')->get()->getResultArray(); // İletişim mesajlarını getir
---
SELECT *
FROM `contact_messages`

    public function getProducts()
    {
        return $this->db->table('product')->get()->getResultArray(); // 'product' tablosundaki tüm ürünleri getir
---
SELECT *
FROM `product`