app/Models/OrderModel.php

    public function createOrder($data)
    {
        return $this->insert($data);  // Veriyi tabloya ekler
---
INSERT INTO `orders` (`name`, `address`, `phone`, `total_price`, `created_at`, `updated_at`) VALUES ('Taha Mirsat', 'İstanbul Gaziosmanpaşa Kazımkarabekir', '5522817692', '14500.00', '2025-01-29 18:32:14', '2025-01-29 18:32:14')